# Name Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ModuleSettings..::..Name Property
ModuleSettings Class See Also
---
The module name.
**Namespace:** Autodesk.Revit.DB.Macros**Assembly:** RevitAPIMacros (in RevitAPIMacros.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public string Name { get; set; }
```

Visual Basic
---
```text
Public Property Name As String
	Get
	Set
```

Visual C++
---
```text
public:
property String^ Name {
	String^ get ();
	void set (String^ value);
}
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | When setting this property: A non-optional argument was null |

# See Also
ModuleSettings Class
Autodesk.Revit.DB.Macros Namespace